Revit.Elements.PathOfTravel
PathOfTravel Element.

Revit.Elements.PathOfTravel.m_rvtPathOfTravel
An internal handle on the Revit PathOfTravel element.

Revit.Elements.PathOfTravel.InternalElement
Reference to Revit PathOfTravel Element.

Revit.Elements.PathOfTravel.#ctor(Autodesk.Revit.DB.Analysis.PathOfTravel)
PathOfTravel from existing
rvtPathOfTravel: Revit PathOfTavel element

Revit.Elements.PathOfTravel.LongestOfShortestExitPaths(Revit.Elements.Views.FloorPlanView,Autodesk.DesignScript.Geometry.Point[])
Calculates the longest PathOfTravel(s) of all shortest paths from rooms in the floor plan to the specified exit points.
floorPlan: Floor plan view for which rooms will be used to retrieve longest paths to the specified exit points.
endPtsList: List of end (exit) points.
Returns: List of PathOfTravel elements corresponding to the longest of shortest exit paths from rooms.

Revit.Elements.PathOfTravel.ByFloorPlanPoints(Revit.Elements.Views.FloorPlanView,Autodesk.DesignScript.Geometry.Point[],Autodesk.DesignScript.Geometry.Point[],System.Boolean)
Constructs a list of PathOfTravel elements in a floor plan view between the specified start points and end points.
floorPlan: Floor plan view to place paths of travel on
startPtsList: List of start points
endPtsList: List of end points
manyToMany: If true, paths are created from every point in the start point list to all points in the end point list. If false, a path is created from every point in the start point list to a corresponding point in the end point list with the same index. The two lists must have the same size when not creating many-to-many paths.
Returns: List of PathOfTravel elements; can contain null elements if there is no path between some points.

Revit.Elements.PathOfTravel.GetWayPoints
Returns the WayPoints set from PathOfTravel element.
Returns: List of WayPoints for the given PathOfTravel element.

Revit.Elements.PathOfTravel.RemoveWayPoint(System.Int32)
Removes WayPoint at the specified index from PathOfTravel element.
index: Index of the WayPoint to be removed from the PathOfTravel element.
Returns: The PathOfTravel element after the WayPoint was rmnoved.

Revit.Elements.PathOfTravel.InsertWayPoint(Autodesk.DesignScript.Geometry.Point,System.Int32)
Inserts a WayPoint to PathOfTravel element at the specified index.
wayPoint: The waypoint to insert.
index: The index to insert the waypoint at.
Returns: The PathOfTravel element after the WayPoint was inserted.

Revit.Elements.PathOfTravel.SetWayPoint(Autodesk.DesignScript.Geometry.Point,System.Int32)
Updates WayPoint at the specified index to the new specified position.
newPosition: The position to which WayPoint will be set.
index: The index of WayPoint to update.
Returns: The PathOfTravel element after the WayPoint was set.

Revit.Elements.PathOfTravel.Update(Revit.Elements.PathOfTravel[])
Updates existing PathOfTravel.

Revit.Elements.PathOfTravel.FromExisting(Autodesk.Revit.DB.Analysis.PathOfTravel,System.Boolean)
Create from existing
rvtPathOfTravel: Existing Revit PathOfTravel element
isRevitOwned:
Returns:

Revit.Elements.PathOfTravel.InternalByViewEndPoints(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ})
Construct a new Revit PathOfTravel in a floor plan view between the specified start point and end point
rvtView:
startPoints:
endPoints:
Returns:

Revit.Elements.PathOfTravel.InitPathOfTravel(Autodesk.Revit.DB.Analysis.PathOfTravel)
Initialize a PathOfTravel element from existing Revit element.